applications/solvers/cokeCombustionFoam/SegregatedSteps/runs/complicatedPorousMedia/combustions/optimize/tiny2_1/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    "coke.*"
    {
        solver          diagonal;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        GaussSeidel;
        // solver          PCG;
        // preconditioner  DIC;
        tolerance       1e-6;
        relTol          0.01;
        maxIter         100;
        // relTol          0;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-6;
        relTol          0;
    }


    "(h|e)"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
    }

    "(h|e)Final"
    {
        $h;
        tolerance       1e-8;
        relTol          0;
    }

    "(U|Yi)"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
        // relTol          0;
    }

    "(U||Yi)Final"
    {
        $U;
        tolerance       1e-8;
        relTol          0;
    }

}


PIMPLE
{
    momentumPredictor no;
    nNonOrthogonalCorrectors 0;
    nCorrectors       1;
    nOuterCorrectors  15;

    outerCorrectorResidualControl
    {
        "(h|e)"    
        {
            tolerance  1e-6;
            relTol     0;
        }

        // "(Y.*|O2|CO2)"    
        // {
        //     tolerance  1e-6;
        //     relTol     0;
        // }
        
    }

}


// relaxationFactors
// {
//     equations
//     {
//         "Y"            0.9;
//         "(h|e)"            0.9;
//     }
//     equations
//     {
//         "Y.*Final"            1.0;
//         "(h|e)Final"            1.0;
//     }
// }

//     // fields
//     // {
//     //     p_rgh           0.7;
//     // }
// }



// ************************************************************************* //
